; domain
(define (domain navigation)
  (:requirements :strips)
  (:predicates
    (at-player ?l )
    (h-adjacent ?l1 ?l2)
    (v-adjacent ?l1 ?l2)
    (at-wall ?l)
  )

(:types
  position 
)

  ;; Move Player Up
  (:action up
    :effect (forall (?l1 ?l2 - position) (when (and (at-player ?l1) 
                       (v-adjacent ?l1 ?l2)
                       (not (at-wall ?l2))        
    ) (and (not (at-player ?l1)) 
                 (at-player ?l2)
            )) )
  )

  ;; Move Player Down
  (:action down
    :effect (forall (?l1 ?l2 - position)
    (when (and (at-player ?l1) 
                       (v-adjacent ?l2 ?l1)
                       (not (at-wall ?l2))
    ) (and (not (at-player ?l1)) 
                 (at-player ?l2)
            ))
     )
  )

  ;; Move Player Left
  (:action left
    :effect (forall (?l1 ?l2 - position) 
    (when (and (at-player ?l1) 
                       (h-adjacent ?l2 ?l1) 
                       (not (at-wall ?l2))
    ) (and (not (at-player ?l1)) 
                 (at-player ?l2)
            ))
    )
  )

  ;; Move Player Right
  (:action right
    :effect (forall (?l1 ?l2 - position)
    (when (and (at-player ?l1) 
                       (h-adjacent ?l1 ?l2) 
                       (not (at-wall ?l2))
    ) 
    (and (not (at-player ?l1)) 
                 (at-player ?l2)
            ))
    )
  )
)

; problem
;; PDDL Instance for A
(define (problem Navigation)
(:domain navigation)
(:objects
    x1_y1 x1_y2 x1_y3 x1_y4 x1_y5 x2_y1 x2_y2 x2_y3 x2_y4 x2_y5 x3_y1 x3_y2 x3_y3 x3_y4 x3_y5 x4_y1 x4_y2 x4_y3 x4_y4 x4_y5 x5_y1 x5_y2 x5_y3 x5_y4 x5_y5 - position
  )
(:init
(at-player x5_y1)

(h-adjacent x1_y1 x2_y1) (h-adjacent x2_y1 x3_y1) (h-adjacent x3_y1 x4_y1) (h-adjacent x4_y1 x5_y1)
(h-adjacent x1_y2 x2_y2) (h-adjacent x2_y2 x3_y2) (h-adjacent x3_y2 x4_y2) (h-adjacent x4_y2 x5_y2)
(h-adjacent x1_y3 x2_y3) (h-adjacent x2_y3 x3_y3) (h-adjacent x3_y3 x4_y3) (h-adjacent x4_y3 x5_y3)
(h-adjacent x1_y4 x2_y4) (h-adjacent x2_y4 x3_y4) (h-adjacent x3_y4 x4_y4) (h-adjacent x4_y4 x5_y4)
(h-adjacent x1_y5 x2_y5) (h-adjacent x2_y5 x3_y5) (h-adjacent x3_y5 x4_y5) (h-adjacent x4_y5 x5_y5)

(v-adjacent x1_y1 x1_y2) (v-adjacent x1_y2 x1_y3) (v-adjacent x1_y3 x1_y4) (v-adjacent x1_y4 x1_y5)
(v-adjacent x2_y1 x2_y2) (v-adjacent x2_y2 x2_y3) (v-adjacent x2_y3 x2_y4) (v-adjacent x2_y4 x2_y5)
(v-adjacent x3_y1 x3_y2) (v-adjacent x3_y2 x3_y3) (v-adjacent x3_y3 x3_y4) (v-adjacent x3_y4 x3_y5)
(v-adjacent x4_y1 x4_y2) (v-adjacent x4_y2 x4_y3) (v-adjacent x4_y3 x4_y4) (v-adjacent x4_y4 x4_y5)
(v-adjacent x5_y1 x5_y2) (v-adjacent x5_y2 x5_y3) (v-adjacent x5_y3 x5_y4) (v-adjacent x5_y4 x5_y5)


)
(:goal
(at-player x1_y5)
)
)

; plan
1. (left)
   deleted: (at-player x5_y1)
   added: (at-player x4_y1)
   goals met: 0 of 1
2. (left)
   deleted: (at-player x4_y1)
   added: (at-player x3_y1)
   goals met: 0 of 1
3. (left)
   deleted: (at-player x3_y1)
   added: (at-player x2_y1)
   goals met: 0 of 1
4. (left)
   deleted: (at-player x2_y1)
   added: (at-player x1_y1)
   goals met: 0 of 1
5. (up)
   deleted: (at-player x1_y1)
   added: (at-player x1_y2)
   goals met: 0 of 1
6. (up)
   deleted: (at-player x1_y2)
   added: (at-player x1_y3)
   goals met: 0 of 1
7. (up)
   deleted: (at-player x1_y3)
   added: (at-player x1_y4)
   goals met: 0 of 1
8. (up)
   deleted: (at-player x1_y4)
   added: (at-player x1_y5)
   goals met: 1 of 1
